[
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "When she reached the outskirts of the city, she _____ that she _____to lock the house door. \n i)realized;forgot \n ii) had realized; forgot \n iii) realized; had forgotten",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Neither the teachers nor the principal ________ students who cannot_______ with academic discipline \n i) accept; cope up \n ii) accept; cope \n iii) accepts; cope",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "This teacher ________ here _______ the past ten years with great commitment. \n i) worked; since \n ii) had worked; since \n iii) has been working; for ",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Each of the nurses _______ received first aid training and the trainers have ________ the relevant facts \n i) have; discussed about \n ii) has; discussed \n iii) have; discussed",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "The coach _______ for a special match every third Saturday, but neither of the teams _______ enthusiastic about it. \n i) arranges; is \n ii) is arranging; are \n iii) will arrange; are",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) Yesterday I had met the concerned warden regarding the hostel timings \n ii) Yesterday I had met the warden concerned regarding the hostel timings \n iii) Yesterday I have met the concerned warden regarding the hostel timings",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) My mother as well as my aunt do voluntary sevice for an hour every day \n ii) My mother as well as my aunt do voluntary sevice for a hour every day \n iii) My mother as well as my aunt does voluntary sevice for an hour every day",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) After a month at MAHE, I realize the significance of belonging to a university of repute \n ii) After a month at MAHE, I am realizing the significance of belonging to a university of repute \n iii) After a month at MAHE, I have realized the significance of belonging to a university of repute",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) One of the main concern of the students is getting good placement offers \n ii) One of the main concerns of the students is getting good placement offers \n iii) One of the main concern of the students are getting good placement offers",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) Despite the difference in their ages they were close friends \n ii) Despite of the difference in their ages they were close friends \n iii) Inspite the difference in their ages they were close friends",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Answer the following question in about 350- 400 words: \n 'As the pace of change increases, the very meaning of being human is likely to mutate and physical and cognitive structures will melt'. What are your views on Yuval Noah Harari's ideas on the ways to deal with scenario mentioned above? Elaborate.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Answer the following question in about 350- 400 words: \n 'Culture does not make people. People make culture. If it is true that the full humanity of women is not our culture, then we can and must make it our culture.' Do you agree with the above views of Chimamanda Ngozi Adichie? Elaborate with reference to the text",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Answer the following question in about 350-400 words: \n Read the following passage and provide a response to the question in about 300-350 words. Your response is required to show a critical understanding of the ideas presented in the passage. \n Real praise, the sincere compliment is probably the most useful social tool of all. It's the valued gold coin for conversation. Yet today, it is in danger of losing its brightness. For it is greatly misused and not properly exchanged. What is a true compliment? It's one that benefits both giver and receiver. Once a painter and his young assistant were painting our house. The older man was wearing shiny new shoes. As the man started painting skilfully, my father-in-law said to the boy, ''Son, when you can show up on the job to paint a house, wearing new shoes, you will be the master of your trade.'' The painter smiled and did the best job. We all like to have our sense of personal worth built up or pointed out. And when one expert adds to another's sense of dignity and speaks favourably of his skill, he is offering a compliment of the highest and rarest kind. A compliment differs from flattery in that it is objective and is given without thought of gain. Flattery is often merely lip service or excessive praise given for motive other than expressed. The greatest efforts of the human race have always resulted from the love of praise. This should be inspired in childhood. The wise parent makes it a point to compliment a child who deserves it. A woman I know has a 12-year-old son who considers washing dishes for his mother a great honour. One night, while washing a large dish, it slipped and crashed on the floor. Then his mother said, ''You know, Robert, of all the times you have washed the dishes for me, this is the first time you dropped one''. Anxiety left the boy's face and he smiled. As one psychologist advises, ''Praise virtue and you will find few vices to criticize''. There is an art in this giving of compliments. Thus, the good compliment is always to the point and its timing is important. Don't wait too long to tell a person what a good talk he gave or how well he cut your grass. But don't do it immediately when he is expecting it either. Wait. Then when he thinks you may have forgotten, pass the praise. \n (Source: https://www.vsajaipur.com/laravel/public/e-class/5e9f0ce2c02b5.pdf) \n Question: The most powerful social weapon is sincere praise or a statement of appreciation or gratitude. Do you share the author's perspective?",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Write an essay of the following topics in about 600 words. Can technology be a Tool to Attain Sustainability?",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Write an essay of the following topics in about 600 words. The Promising Horizon of VR in Online Learning.",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "She _____ her latest research ideas_____three hours with great enthusiasm. \n i) discussed about; for ii) discussed on; since \n iii) discussed; for",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Each of the children present here_____ to take _____ advice from the teacher. \n i) needs; an \n ii) needs; some \n iii) need; a",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "The crew of the ship_____ of the opinion that the captain must be congratulated _____his leadership skills. \n i) were; for \n ii) was; for \n iii) was; on",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "_____ his financial problems, he is one of the most optimistic _____ of our group \n i) inspite; member \n ii) despite; members \n iii) despite; member",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "I _____a lot of time yesterday at a conference with _____ Ethiopian professor of great repute \n i) had spent; a \n ii) had spent; an \n iii) spent; an ",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) The coach as well as the captain of the team were reprimanded for quarrelling with the refree \n ii) The coach as well as the captain of the team was reprimanded for quarrelling with the refree \n iii) The coach as well as the captain of the team have been reprimanded for quarrelling with the refree ",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) She had reached the station after the train had left.  \n ii) She had reached the station after the train left. \n iii)  She reached the station after the train had left. ",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) Neither of us are able to cope up with this hectic academic schedule  \n ii) Neither of us is able to cope with this hectic academic schedule \n iii)  Neither of us are able to cope up with this hectic academic schedule ",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) The proprietor knew that it will not be easy to find an honest worker  \n ii) The proprietor knew that it would not be easy to find a honest worker \n iii)  The proprietor knew that it would not be easy to find an honest worker ",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Choose the grammatically correct sentence: \n i) I am owning a big house and also its adjacent grounds  \n ii) I am own a big house and also its adjacent grounds \n iii)  I am owning a big house and also it's adjacent grounds",
        "source_year": 2024,
        "difficulty": "easy",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Answer the following question in about 350- 400 words: \n According to Chimamanda Adichie, the current conception of gender is flawed and must be addressed through concerted action. Do you share these perspectives? Elaborate on your response in light of the arguments presented within the text.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Answer the following question in about 350- 400 words: \n Chimamanda Ngozi Adichie is of the view that to achieve a positive change ''..we must raise our daughters differently. We must also raise our sons differently''. Do you agree with her ideas on how we should raise our children? Elaborate.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Read the following passage and provide a response to the question in about 300-350 words. Your response is required to show a critical understanding of the ideas presented in the passage. \n To date happiness has defied definition. Most people tend to equate happiness with fun, good living, plenty of money. If happiness were synonymous with all this, rich people with all their luxuries and countless parties, would be perpetually happy. But in actual fact, they are, frequently, acutely unhappy, despite their riches and ability to indulge in fun activities at will. Fun is what we experience during an act; happiness is that intangible something we experience after an act. We may have fun watching a movie, going shopping, meeting friends -these are all fun activities that afford us fleeting moments of relaxation and enjoyment. Happiness, on the other hand, is a much stronger, deeper and more abiding emotion. If we perceive happiness as the ultimate goal, we must also devise a way to reach that goal. The way to happiness is not a smooth, broad highway along which we can cruise at a comfortable speed. It is a path through rocky and rugged terrain and the going can become very tough at times. At these times we have to roll up our sleeves and with pitchfork and shovel make our way onwards. This pursuit of happiness lasts a lifetime. Great happiness is earned only by great effort and effort not in spurts but diligent, constant effort. In this connection we are confronted with another fallacy, that fun and pleasure mean happiness and thus pain, its corollary, must be synonymous with unhappiness. But in fact, the truth is quite different. Things that bring us happiness, more often than not, involve some amount of pain. It is because of misconception that people avoid the very endeavour that is the source of true happiness. Difficult endeavours-such as the raising of children, establishing deeper relationships with loved ones, trying to do something worthwhile in life -hold the promise of a world of happiness. Happiness is not a permanent vocation. Another prevalent belief is that if one were rich enough not to have to work, one would be blissfully happy. But a job is more than just a pay cheque. Almost, all religions teach us that work is worship. Work holds the key to happiness as doing something which increases confidence and self-worth. It brings on a feeling of satisfaction, of doing something, of contributing. Job satisfaction comes less from how much one earns than from the challenge of the job. \n (Source: https://www.vsajaipur.com/laravel/public/e-class/5e9f0ce2c02b5.pdf) \n Question: The key to contentment is to engage in work that enhances one's self-esteem and confidence. Engaging in such activities elicits a sense of fulfilment, accomplishment, and contribution. Job satisfaction is derived more from the inherent difficulty of the position rather than one's salary. Do you share the author's perspective?",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Write an essay on the following topic in about 600 words. \n Does cinema in India shape the popular culture or merely reflect the existing social values?",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "ENG",
        "question_text": "Write an essay on the following topic in about 600 words. \n The growing level of competition is a healthy sign.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    }


]   
