[
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "A boiler supplies steam at 3 N/mm2 and 300oC at 5000 kg/hr. The feed water is supplied at 30oC. Fuel is supplied at 800kg/hr whose calorific value is 22MJ/kg.\n i) Find the boiler efficiency.\n ii) If the efficiency of boiler is to be increased by 5% in absolute terms, what should be the ratio of steam generation rate to fuel consumption rate assuming the heat gained by water in the boiler remain same? \n iii) If an economiser is used to preheat the feed water by 5oC and reduce fuel consumption by 5%, what will be the new efficiency? Assume the specific heat of water as 4.18 kJ/kgK and that of superheated steam as 2.25 kJ/kgK",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "5kg of steam at a pressure of 2bar is supplied to a pipeline at 200oC. Due to poor insulation, steam loses 2000kJ of heat in the pipeline at constant pressure conditions.The steam coming out of the pipeline is further supplied to a turbine where the steam condition must be superheated with a degree of superheat of 100oC. What quantity of heat should be supplied to steam at the pipeline exit if the required condition of steam has to be achieved at turbine inlet? Assume the specific heat of superheated steam as 2.25 kJ/KgK",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Explain any three differences between boiler mounting and boiler accessories.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "  An electric bike makes use of flat open belt drive for power transmission between motor shaft and wheel shaft. The shafts are placed at a centre distance of 500mm. The velocity ratio of the drive is limited to 3. The maximum tension in the belt is found to be 1740 N. The speed and diameter of the driver pulley are 300 rpm and 100 mm respectively. What is the power transmitted by the belt drive? What will be the length of belt? Assume the coefficient of friction between the belt and the pulley surface as 0.3.",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "The following gear wheels are available to form a compound gear train. Sketch the arrangement of gear train to get maximum velocity ratio using four shafts and calculate  the same. Also mention the conditions used to achieve maximum velocity ratio.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": ["data/question_images/Screenshot 2025-08-16 125831.png."]
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": " List ANY THREE advantages of belt drive system and chain drive system?",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "A twin cylinder diesel engine admitting charge in to the engine cylinder in an indirect manner has fuel consumption as 0.257 kg/kWh at 25 cycles per second. The calorific value of diesel is 43,900 kJ/kg. The net brake load is 70 kg and the mean circumference of the brake drum is 4m. Determine the brake thermal efficiency of the engine.",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Identify and explain the working of an I.C engine which admits the charge in an indirect manner and has a compression ratio of 9.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Justify the following statements\n i) Brake Power cannot be equal or more than Indicated Power \nii) Two stroke engines do not need a cam shaft \n iii) Heavier flywheel is used in 4 stroke engines.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Identify and hence explain the lathe operations for the following with neat sketches\n i) Removal of sharp corners on shaft ends \nii) To get serrated surface which helps in effective gripping",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Compare the following drilling operations with the help of neat sketches: Reaming and Boring",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Why additive manufacturing is called so? List the steps involved in making of parts using this technique",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Explain the significance of the following moulding sand properties\n i) Permeability\n ii) Flowability \niii) Cohesiveness \niv) Refractoriness",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Suggest a suitable welding process that makes use of a non-consumable electrode and facilitates joining of dissimilar metals.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "What advantages do you see with installation of CNC machines on a shop floor? List any 6 points.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },


    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "  A chemical processing industry uses a water tube boiler which can generate 22% wet steam at 900 kPa. The hourly steam requirement is 780 kg. The feed water is supplied from a nearby reservoir maintained at 28°C. The boiler is fired using wood pellets and coconut shell in a 6:4 mass ratio. The gross calorific value of wood pellets and coconut shell are 19600 kJ/kg and 20800 kJ/kg respectively. Calculate the hourly consumption of wood pellets and coconut shells. The boiler operates with an efficiency of 60%. To improve the efficiency of the boiler, the following options are considered both of which reduce the fuel consumption by 12%:\n i) Use of an economizer which increases the feed water temperature by 50°C\n ii) Use of an air preheater which improves the combustion of fuel.\n Suggest the industry regarding which option it has to use to improve the efficiency of the boiler. Justify your suggestion through comparison of boiler efficiencies using the above mentioned accessories.",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": " 1310 kg of steam which is 15.75% wet is produced in a boiler at a pressure of 2.5 N/mm2. Steam enters the super heater where its temperature is raised such that the degree of superheat is 160˚C. From the super heater, the steam is led to a heat exchanger for process heating where it loses 27.2% of enthalpy. If the temperature of feed water is 32˚C, determine:\n i) Total heat added to feed water in the boiler\n ii) Total heat supplied in the super heater\n iii) Condition and related parameter of the steam at the exit point of heat exchanger",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Give reasons for the following:\n i) Boiler mountings are an integral part of a boiler.\n ii) Saturated steam cannot be produced in the boiler drum.\n iii) Water tube boilers generally operate at higher operating pressures.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "A crusher in a mining setup uses a flat belt drive to transmit power between two parallel shafts running in opposing directions. The driver pulley, has a diameter of 300 mm, and the output shaft rotates at a speed of 250 rpm. The centre distance between the driver and driven pulleys is 800 mm. The speed reduction ratio is 3/2. Given an initial tension of 1500 N in the belt, determine the tension on the tight and slack side of the belt. Also, determine the power transmitted and compute the length of the belt. Assume coefficient of friction to be 0.28",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "The power train of a machine consists of a combination of open flat belt drive and a compound gear train. The machine is being driven by a motor running at 1200 rpm. The power is transmitted from the motor to the gear train by a belt drive with a speed reduction ratio of 4. The compound gear train consists of 6 spur gears, A, B, C, D, E and F. The gear train is built in such a way that Gear A meshes with B, C meshes with D while E meshes with F. Gears B and C are compound gears and so are gears D and E. Gear A has 30 teeth with module 3 mm while Gear D with module 2 mm has 126 teeth. Gear E having module 2 mm has 24 teeth. The speed reduction ratios from gear A to B is 2, from C to D it is 3 while from E to F it is 5. Find the number of teeth for gears B, C and F. Also determine the speed at gear F and the centre distance of the gear train. Show the arrangement.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": " A machine is being designed in which four different speeds are required. Suggest a suitable system and explain the construction and working of the same with the help of a neat sketch.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "The following data refers to a twin cylinder I C engine cylinder diameter=200mm, Stroke length= 300mm, Total cam shaft revolutions/hour= 18000, Mean effective pressure= 6bar, Fuel consumption= 15litres/hour, Calorific value of the fuel= 45000kJ/kg, Specific gravity of the fuel= 0.8, Determine the indicated thermal efficiency?",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Sketch and explain the working principle of an I C engine fitted with a carburetor and a camshaft.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Give reasons for the following:\n i) Four stroke engines are more fuel efficient than two stroke engines.\n ii) Petrol engine is lighter compared to diesel engine\n iii) High rate of wear and tear exists for two stroke engines",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": " With neat sketch, explain any four lathe operations.",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "With neat sketch and labelling, explain the features of radial drilling machine.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": "Explain the characteristics of additive manufacturing.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": " Explain draft and shrinkage allowances used in casting process with neat sketches.",
        "source_year": 2024,
        "difficulty": "hard",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": " With neat sketch explain the working of resistance spot welding",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    },
    {
        "department": "B.Tech",
        "acad_year": 2,
        "exam_type": "end",
        "subject": "BME",
        "question_text": " Explain the limitations of NC machine.",
        "source_year": 2024,
        "difficulty": "medium",
        "date_added": "2025-16-08",
        "images": []
    }
]   